Revit 2027 API
PrimaryDesignOptionMemberFilter(Boolean) Constructor
 Constructs a new instance of a filter to match elements contained in any primary design option of any design option set, with the option to invert the filter and find elements not contained in any primary design option of any design option set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PrimaryDesignOptionMemberFilter(
	bool inverted
)
Public Sub New (
	inverted As Boolean
)
public:
PrimaryDesignOptionMemberFilter(
	bool inverted
)
new :
        inverted : bool -> PrimaryDesignOptionMemberFilter
Parameters
inverted Boolean
 True if the filter should match all elements which are not contained within a particular design option.
See Also
Reference
PrimaryDesignOptionMemberFilter Class
PrimaryDesignOptionMemberFilter Overload
Autodesk.Revit.DB Namespace